src/cf/Documents/otus_ЗаявкаОнбординг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>otus_ЗаявкаОнбординг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетДоступов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_ПакетыДоступов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НужноОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусыЗаявкиОнбординга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиВРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/otus_СтатусыЗаявкиОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>otus_СтатусыЗаявкиОнбординга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Звершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/otus_ЗаявкаОнбординг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОтправитьВРаботуНаСервере(ЗаявкаОнбординг)
    Если ЗначениеЗаполнено(ЗаявкаОнбординг.Проведен) Тогда
        
    Иначе
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Перед отправкой документа в работу необходимо выполнить его проведение!'", "ru"));
        Возврат;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВРаботу(Команда)
    Если ЭтотОбъект.ПроверитьЗаполнение() Тогда
        ОтправитьВРаботуНаСервере(Объект.Ссылка);
    Иначе
        ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить все обязательные поля документа!'"));
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявкуНаСервере()
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
    ОтменитьЗаявкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЗначениеЗаполнено(Объект.Ссылка)
        И Объект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.ВРаботе
        Или Объект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Звершено
        Или Объект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Отменено Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сотрудник", "ТолькоПросмотр", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыхода", "ТолькоПросмотр", Истина);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НужноОборудование", "ТолькоПросмотр", Истина);
    КонецЕсли;
КонецПроцедуры
